#!/bin/sh

driver="pango_pci_driver"
target="app"
root_name="root"                                    # 默认管理员名：root 
temp_name=$(whoami)                                 # 获取控制台当前的操作用户名

# ================= 核心修改部分 =================
if [ "$temp_name" != "$root_name" ]; then
    echo "当前操作用户名：$temp_name"
    echo "检测到需要管理员权限，正在自动提权并保留环境变量..."
    # 使用 sudo -E 重新执行当前脚本 ($0)，并传递所有原有参数 ($@)
    exec sudo -E sh "$0" "$@"
fi
# ================================================

# 下面的代码只有在已经是 root 的情况下才会执行
echo "****************************复位PCIe设备***************************"
sh ../reset_pcie.sh

if [ `lsmod | grep -o "$driver"` ]; then
    echo "****************************PCIe驱动已装载***************************"
else
    echo "*************************开始编译PCIe驱动程序************************"
    cd ./driver
    make clean
    bear -- make
    echo "***************************开始装载PCIe驱动**************************"
    insmod $driver.ko                               # 装载驱动
    cd ..
    if [ `lsmod | grep -o "$driver"` ]; then
        echo "***************************PCIe驱动装载成功**************************"
    else
        echo "***************************PCIe驱动装载失败**************************"
        exit
    fi
fi

echo "*************************开始编译应用程序************************"
cd ./app_pcie
make clean
bear -- make
echo "***************************启动可执行程序************************"
sudo systemctl stop lightdm
cd ./build
./$target
cd ../..
echo "***************************退出可执行程序************************"
rmmod $driver                                       # 卸载驱动
echo "***************************卸载PCIe驱动**************************"